; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f5-c10-s4-i10-013-113-213-313
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12 h13
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12 s13
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12 d13
 - card
          celln0 celln1 celln2 celln3 celln4 celln5 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 coln10 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value c13 n13)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value h13 n13)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value s13 n13)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(value d13 n13)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(cellsuccessor celln5 celln4)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(colsuccessor coln10 coln9)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(successor n13 n12)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit c13 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit h13 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit s13 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(hassuit d13 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack c12 h13)
(canstack c12 d13)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack h12 c13)
(canstack h12 s13)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack s12 h13)
(canstack s12 d13)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(canstack d12 c13)
(canstack d12 s13)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln5)
(colspace coln0)

(bottomcol s4)
(on d5 s4)
(on d2 d5)
(on d9 d2)
(on s6 d9)
(on s3 s6)
(clear s3)

(bottomcol s1)
(on h6 s1)
(on d1 h6)
(on c5 d1)
(clear c5)

(bottomcol c1)
(on s10 c1)
(on c8 s10)
(clear c8)

(bottomcol s8)
(on h7 s8)
(clear h7)

(bottomcol d12)
(on d8 d12)
(on s7 d8)
(on d4 s7)
(on s11 d4)
(on c2 s11)
(on h1 c2)
(clear h1)

(bottomcol h9)
(on h13 h9)
(on h12 h13)
(on s9 h12)
(on s2 s9)
(clear s2)

(bottomcol s5)
(on d13 s5)
(on h3 d13)
(on c7 h3)
(on c13 c7)
(on h8 c13)
(clear h8)

(bottomcol d3)
(on d7 d3)
(on h4 d7)
(on c11 h4)
(on h11 c11)
(on c4 h11)
(clear c4)

(bottomcol c6)
(on d10 c6)
(on c3 d10)
(on s13 c3)
(on d11 s13)
(on h2 d11)
(on c9 h2)
(clear c9)

(bottomcol c12)
(on d6 c12)
(on h10 d6)
(on h5 h10)
(on c10 h5)
(on s12 c10)
(clear s12)
)
(:goal
(and
(home c13)
(home h13)
(home s13)
(home d13)
)
)
)

; plan
1. (sendtohome h1 c2 h n1 h0 n0)
   deleted: (on h1 c2) (home h0) (clear h1)
   added: (home h1) (clear c2)
   goals met: 0 of 4
2. (sendtofree c5 d1 celln5 celln4)
   deleted: (on c5 d1) (clear c5) (cellspace celln5)
   added: (incell c5) (clear d1) (cellspace celln4)
   goals met: 0 of 4
3. (sendtohome d1 h6 d n1 d0 n0)
   deleted: (on d1 h6) (home d0) (clear d1)
   added: (home d1) (clear h6)
   goals met: 0 of 4
4. (sendtofree h6 s1 celln4 celln3)
   deleted: (on h6 s1) (clear h6) (cellspace celln4)
   added: (incell h6) (clear s1) (cellspace celln3)
   goals met: 0 of 4
5. (sendtohome-b s1 s n1 s0 n0 coln0 coln1)
   deleted: (home s0) (clear s1) (bottomcol s1) (colspace coln0)
   added: (home s1) (colspace coln1)
   goals met: 0 of 4
6. (sendtohome s2 s9 s n2 s1 n1)
   deleted: (on s2 s9) (home s1) (clear s2)
   added: (home s2) (clear s9)
   goals met: 0 of 4
7. (sendtofree c2 s11 celln3 celln2)
   deleted: (on c2 s11) (clear c2) (cellspace celln3)
   added: (incell c2) (clear s11) (cellspace celln2)
   goals met: 0 of 4
8. (sendtofree c9 h2 celln2 celln1)
   deleted: (on c9 h2) (clear c9) (cellspace celln2)
   added: (incell c9) (clear h2) (cellspace celln1)
   goals met: 0 of 4
9. (sendtohome h2 d11 h n2 h1 n1)
   deleted: (on h2 d11) (home h1) (clear h2)
   added: (home h2) (clear d11)
   goals met: 0 of 4
10. (sendtohome s3 s6 s n3 s2 n2)
   deleted: (on s3 s6) (home s2) (clear s3)
   added: (home s3) (clear s6)
   goals met: 0 of 4
11. (sendtofree c4 h11 celln1 celln0)
   deleted: (on c4 h11) (clear c4) (cellspace celln1)
   added: (incell c4) (clear h11) (cellspace celln0)
   goals met: 0 of 4
12. (sendtonewcol s11 d4 coln1 coln0)
   deleted: (on s11 d4) (colspace coln1)
   added: (bottomcol s11) (clear d4) (colspace coln0)
   goals met: 0 of 4
13. (move s6 d9 h7)
   deleted: (on s6 d9) (clear h7)
   added: (on s6 h7) (clear d9)
   goals met: 0 of 4
14. (move c8 s10 d9)
   deleted: (on c8 s10) (clear d9)
   added: (on c8 d9) (clear s10)
   goals met: 0 of 4
15. (move s10 c1 d11)
   deleted: (on s10 c1) (clear d11)
   added: (on s10 d11) (clear c1)
   goals met: 0 of 4
16. (sendtohome-b c1 c n1 c0 n0 coln0 coln1)
   deleted: (home c0) (clear c1) (bottomcol c1) (colspace coln0)
   added: (home c1) (colspace coln1)
   goals met: 0 of 4
17. (homefromfreecell c2 c n2 c1 n1 celln0 celln1)
   deleted: (incell c2) (cellspace celln0) (home c1)
   added: (home c2) (cellspace celln1)
   goals met: 0 of 4
18. (sendtofree d4 s7 celln1 celln0)
   deleted: (on d4 s7) (clear d4) (cellspace celln1)
   added: (incell d4) (clear s7) (cellspace celln0)
   goals met: 0 of 4
19. (sendtonewcol s6 h7 coln1 coln0)
   deleted: (on s6 h7) (colspace coln1)
   added: (bottomcol s6) (clear h7) (colspace coln0)
   goals met: 0 of 4
20. (move h7 s8 c8)
   deleted: (on h7 s8) (clear c8)
   added: (on h7 c8) (clear s8)
   goals met: 0 of 4
21. (move-b s6 h7 coln0 coln1)
   deleted: (bottomcol s6) (clear h7) (colspace coln0)
   added: (on s6 h7) (colspace coln1)
   goals met: 0 of 4
22. (sendtonewcol s9 h12 coln1 coln0)
   deleted: (on s9 h12) (colspace coln1)
   added: (bottomcol s9) (clear h12) (colspace coln0)
   goals met: 0 of 4
23. (move h8 c13 s9)
   deleted: (on h8 c13) (clear s9)
   added: (on h8 s9) (clear c13)
   goals met: 0 of 4
24. (move s7 d8 h8)
   deleted: (on s7 d8) (clear h8)
   added: (on s7 h8) (clear d8)
   goals met: 0 of 4
25. (colfromfreecell h6 s7 celln0 celln1)
   deleted: (incell h6) (cellspace celln0) (clear s7)
   added: (cellspace celln1) (clear h6) (on h6 s7)
   goals met: 0 of 4
26. (sendtofree c13 c7 celln1 celln0)
   deleted: (on c13 c7) (clear c13) (cellspace celln1)
   added: (incell c13) (clear c7) (cellspace celln0)
   goals met: 0 of 4
27. (move c7 h3 d8)
   deleted: (on c7 h3) (clear d8)
   added: (on c7 d8) (clear h3)
   goals met: 0 of 4
28. (sendtohome h3 d13 h n3 h2 n2)
   deleted: (on h3 d13) (home h2) (clear h3)
   added: (home h3) (clear d13)
   goals met: 0 of 4
29. (move s12 c10 d13)
   deleted: (on s12 c10) (clear d13)
   added: (on s12 d13) (clear c10)
   goals met: 0 of 4
30. (move h11 c11 s12)
   deleted: (on h11 c11) (clear s12)
   added: (on h11 s12) (clear c11)
   goals met: 0 of 4
31. (move c10 h5 h11)
   deleted: (on c10 h5) (clear h11)
   added: (on c10 h11) (clear h5)
   goals met: 0 of 4
32. (move h5 h10 s6)
   deleted: (on h5 h10) (clear s6)
   added: (on h5 s6) (clear h10)
   goals met: 0 of 4
33. (move c11 h4 h12)
   deleted: (on c11 h4) (clear h12)
   added: (on c11 h12) (clear h4)
   goals met: 0 of 4
34. (sendtohome h4 d7 h n4 h3 n3)
   deleted: (on h4 d7) (home h3) (clear h4)
   added: (home h4) (clear d7)
   goals met: 0 of 4
35. (sendtohome h5 s6 h n5 h4 n4)
   deleted: (on h5 s6) (home h4) (clear h5)
   added: (home h5) (clear s6)
   goals met: 0 of 4
36. (move d7 d3 s8)
   deleted: (on d7 d3) (clear s8)
   added: (on d7 s8) (clear d3)
   goals met: 0 of 4
37. (sendtohome h6 s7 h n6 h5 n5)
   deleted: (on h6 s7) (home h5) (clear h6)
   added: (home h6) (clear s7)
   goals met: 0 of 4
38. (move s6 h7 d7)
   deleted: (on s6 h7) (clear d7)
   added: (on s6 d7) (clear h7)
   goals met: 0 of 4
39. (sendtohome h7 c8 h n7 h6 n6)
   deleted: (on h7 c8) (home h6) (clear h7)
   added: (home h7) (clear c8)
   goals met: 0 of 4
40. (move h10 d6 c11)
   deleted: (on h10 d6) (clear c11)
   added: (on h10 c11) (clear d6)
   goals met: 0 of 4
41. (move d6 c12 c7)
   deleted: (on d6 c12) (clear c7)
   added: (on d6 c7) (clear c12)
   goals met: 0 of 4
42. (colfromfreecell c9 h10 celln0 celln1)
   deleted: (incell c9) (cellspace celln0) (clear h10)
   added: (cellspace celln1) (clear c9) (on c9 h10)
   goals met: 0 of 4
43. (sendtofree c8 d9 celln1 celln0)
   deleted: (on c8 d9) (clear c8) (cellspace celln1)
   added: (incell c8) (clear d9) (cellspace celln0)
   goals met: 0 of 4
44. (move d9 d2 c10)
   deleted: (on d9 d2) (clear c10)
   added: (on d9 c10) (clear d2)
   goals met: 0 of 4
45. (sendtohome d2 d5 d n2 d1 n1)
   deleted: (on d2 d5) (home d1) (clear d2)
   added: (home d2) (clear d5)
   goals met: 0 of 4
46. (sendtohome-b d3 d n3 d2 n2 coln0 coln1)
   deleted: (home d2) (clear d3) (bottomcol d3) (colspace coln0)
   added: (home d3) (colspace coln1)
   goals met: 0 of 4
47. (homefromfreecell d4 d n4 d3 n3 celln0 celln1)
   deleted: (incell d4) (cellspace celln0) (home d3)
   added: (home d4) (cellspace celln1)
   goals met: 0 of 4
48. (sendtohome d5 s4 d n5 d4 n4)
   deleted: (on d5 s4) (home d4) (clear d5)
   added: (home d5) (clear s4)
   goals met: 0 of 4
49. (sendtohome-b s4 s n4 s3 n3 coln1 coln2)
   deleted: (home s3) (clear s4) (bottomcol s4) (colspace coln1)
   added: (home s4) (colspace coln2)
   goals met: 0 of 4
50. (sendtohome d6 c7 d n6 d5 n5)
   deleted: (on d6 c7) (home d5) (clear d6)
   added: (home d6) (clear c7)
   goals met: 0 of 4
51. (sendtofree s7 h8 celln1 celln0)
   deleted: (on s7 h8) (clear s7) (cellspace celln1)
   added: (incell s7) (clear h8) (cellspace celln0)
   goals met: 0 of 4
52. (sendtohome h8 s9 h n8 h7 n7)
   deleted: (on h8 s9) (home h7) (clear h8)
   added: (home h8) (clear s9)
   goals met: 0 of 4
53. (sendtonewcol s6 d7 coln2 coln1)
   deleted: (on s6 d7) (colspace coln2)
   added: (bottomcol s6) (clear d7) (colspace coln1)
   goals met: 0 of 4
54. (sendtohome d7 s8 d n7 d6 n6)
   deleted: (on d7 s8) (home d6) (clear d7)
   added: (home d7) (clear s8)
   goals met: 0 of 4
55. (sendtonewcol c7 d8 coln1 coln0)
   deleted: (on c7 d8) (colspace coln1)
   added: (bottomcol c7) (clear d8) (colspace coln0)
   goals met: 0 of 4
56. (sendtohome d8 d12 d n8 d7 n7)
   deleted: (on d8 d12) (home d7) (clear d8)
   added: (home d8) (clear d12)
   goals met: 0 of 4
57. (sendtohome d9 c10 d n9 d8 n8)
   deleted: (on d9 c10) (home d8) (clear d9)
   added: (home d9) (clear c10)
   goals met: 0 of 4
58. (move-b s11 d12 coln0 coln1)
   deleted: (bottomcol s11) (clear d12) (colspace coln0)
   added: (on s11 d12) (colspace coln1)
   goals met: 0 of 4
59. (sendtonewcol s10 d11 coln1 coln0)
   deleted: (on s10 d11) (colspace coln1)
   added: (bottomcol s10) (clear d11) (colspace coln0)
   goals met: 0 of 4
60. (move d11 s13 c12)
   deleted: (on d11 s13) (clear c12)
   added: (on d11 c12) (clear s13)
   goals met: 0 of 4
61. (move-b s10 d11 coln0 coln1)
   deleted: (bottomcol s10) (clear d11) (colspace coln0)
   added: (on s10 d11) (colspace coln1)
   goals met: 0 of 4
62. (sendtonewcol s13 c3 coln1 coln0)
   deleted: (on s13 c3) (colspace coln1)
   added: (bottomcol s13) (clear c3) (colspace coln0)
   goals met: 0 of 4
63. (sendtohome c3 d10 c n3 c2 n2)
   deleted: (on c3 d10) (home c2) (clear c3)
   added: (home c3) (clear d10)
   goals met: 0 of 4
64. (homefromfreecell c4 c n4 c3 n3 celln0 celln1)
   deleted: (incell c4) (cellspace celln0) (home c3)
   added: (home c4) (cellspace celln1)
   goals met: 0 of 4
65. (homefromfreecell c5 c n5 c4 n4 celln1 celln2)
   deleted: (incell c5) (cellspace celln1) (home c4)
   added: (home c5) (cellspace celln2)
   goals met: 0 of 4
66. (sendtohome d10 c6 d n10 d9 n9)
   deleted: (on d10 c6) (home d9) (clear d10)
   added: (home d10) (clear c6)
   goals met: 0 of 4
67. (sendtohome-b c6 c n6 c5 n5 coln0 coln1)
   deleted: (home c5) (clear c6) (bottomcol c6) (colspace coln0)
   added: (home c6) (colspace coln1)
   goals met: 0 of 4
68. (sendtohome-b c7 c n7 c6 n6 coln1 coln2)
   deleted: (home c6) (clear c7) (bottomcol c7) (colspace coln1)
   added: (home c7) (colspace coln2)
   goals met: 0 of 4
69. (homefromfreecell c8 c n8 c7 n7 celln2 celln3)
   deleted: (incell c8) (cellspace celln2) (home c7)
   added: (home c8) (cellspace celln3)
   goals met: 0 of 4
70. (sendtohome c9 h10 c n9 c8 n8)
   deleted: (on c9 h10) (home c8) (clear c9)
   added: (home c9) (clear h10)
   goals met: 0 of 4
71. (sendtohome c10 h11 c n10 c9 n9)
   deleted: (on c10 h11) (home c9) (clear c10)
   added: (home c10) (clear h11)
   goals met: 0 of 4
72. (sendtofree s11 d12 celln3 celln2)
   deleted: (on s11 d12) (clear s11) (cellspace celln3)
   added: (incell s11) (clear d12) (cellspace celln2)
   goals met: 0 of 4
73. (sendtofree h10 c11 celln2 celln1)
   deleted: (on h10 c11) (clear h10) (cellspace celln2)
   added: (incell h10) (clear c11) (cellspace celln1)
   goals met: 0 of 4
74. (sendtohome c11 h12 c n11 c10 n10)
   deleted: (on c11 h12) (home c10) (clear c11)
   added: (home c11) (clear h12)
   goals met: 0 of 4
75. (sendtofree h11 s12 celln1 celln0)
   deleted: (on h11 s12) (clear h11) (cellspace celln1)
   added: (incell h11) (clear s12) (cellspace celln0)
   goals met: 0 of 4
76. (sendtonewcol s10 d11 coln2 coln1)
   deleted: (on s10 d11) (colspace coln2)
   added: (bottomcol s10) (clear d11) (colspace coln1)
   goals met: 0 of 4
77. (sendtohome d11 c12 d n11 d10 n10)
   deleted: (on d11 c12) (home d10) (clear d11)
   added: (home d11) (clear c12)
   goals met: 0 of 4
78. (sendtohome-b c12 c n12 c11 n11 coln1 coln2)
   deleted: (home c11) (clear c12) (bottomcol c12) (colspace coln1)
   added: (home c12) (colspace coln2)
   goals met: 0 of 4
79. (sendtohome-b d12 d n12 d11 n11 coln2 coln3)
   deleted: (home d11) (clear d12) (bottomcol d12) (colspace coln2)
   added: (home d12) (colspace coln3)
   goals met: 0 of 4
80. (sendtonewcol s12 d13 coln3 coln2)
   deleted: (on s12 d13) (colspace coln3)
   added: (bottomcol s12) (clear d13) (colspace coln2)
   goals met: 0 of 4
81. (sendtohome d13 s5 d n13 d12 n12)
   deleted: (on d13 s5) (home d12) (clear d13)
   added: (home d13) (clear s5)
   goals met: 1 of 4
82. (sendtohome-b s5 s n5 s4 n4 coln2 coln3)
   deleted: (home s4) (clear s5) (bottomcol s5) (colspace coln2)
   added: (home s5) (colspace coln3)
   goals met: 1 of 4
83. (sendtohome-b s6 s n6 s5 n5 coln3 coln4)
   deleted: (home s5) (clear s6) (bottomcol s6) (colspace coln3)
   added: (home s6) (colspace coln4)
   goals met: 1 of 4
84. (homefromfreecell s7 s n7 s6 n6 celln0 celln1)
   deleted: (incell s7) (cellspace celln0) (home s6)
   added: (home s7) (cellspace celln1)
   goals met: 1 of 4
85. (sendtohome-b s8 s n8 s7 n7 coln4 coln5)
   deleted: (home s7) (clear s8) (bottomcol s8) (colspace coln4)
   added: (home s8) (colspace coln5)
   goals met: 1 of 4
86. (sendtohome-b s9 s n9 s8 n8 coln5 coln6)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln5)
   added: (home s9) (colspace coln6)
   goals met: 1 of 4
87. (sendtohome-b s10 s n10 s9 n9 coln6 coln7)
   deleted: (home s9) (clear s10) (bottomcol s10) (colspace coln6)
   added: (home s10) (colspace coln7)
   goals met: 1 of 4
88. (homefromfreecell s11 s n11 s10 n10 celln1 celln2)
   deleted: (incell s11) (cellspace celln1) (home s10)
   added: (home s11) (cellspace celln2)
   goals met: 1 of 4
89. (sendtohome-b s12 s n12 s11 n11 coln7 coln8)
   deleted: (home s11) (clear s12) (bottomcol s12) (colspace coln7)
   added: (home s12) (colspace coln8)
   goals met: 1 of 4
90. (sendtohome-b s13 s n13 s12 n12 coln8 coln9)
   deleted: (home s12) (clear s13) (bottomcol s13) (colspace coln8)
   added: (home s13) (colspace coln9)
   goals met: 2 of 4
91. (homefromfreecell c13 c n13 c12 n12 celln2 celln3)
   deleted: (incell c13) (cellspace celln2) (home c12)
   added: (home c13) (cellspace celln3)
   goals met: 3 of 4
92. (sendtofree h12 h13 celln3 celln2)
   deleted: (on h12 h13) (clear h12) (cellspace celln3)
   added: (incell h12) (clear h13) (cellspace celln2)
   goals met: 3 of 4
93. (sendtofree h13 h9 celln2 celln1)
   deleted: (on h13 h9) (clear h13) (cellspace celln2)
   added: (incell h13) (clear h9) (cellspace celln1)
   goals met: 3 of 4
94. (sendtohome-b h9 h n9 h8 n8 coln9 coln10)
   deleted: (home h8) (clear h9) (bottomcol h9) (colspace coln9)
   added: (home h9) (colspace coln10)
   goals met: 3 of 4
95. (homefromfreecell h10 h n10 h9 n9 celln1 celln2)
   deleted: (incell h10) (cellspace celln1) (home h9)
   added: (home h10) (cellspace celln2)
   goals met: 3 of 4
96. (homefromfreecell h11 h n11 h10 n10 celln2 celln3)
   deleted: (incell h11) (cellspace celln2) (home h10)
   added: (home h11) (cellspace celln3)
   goals met: 3 of 4
97. (homefromfreecell h12 h n12 h11 n11 celln3 celln4)
   deleted: (incell h12) (cellspace celln3) (home h11)
   added: (home h12) (cellspace celln4)
   goals met: 3 of 4
98. (homefromfreecell h13 h n13 h12 n12 celln4 celln5)
   deleted: (incell h13) (cellspace celln4) (home h12)
   added: (home h13) (cellspace celln5)
   goals met: 4 of 4
